<a href="https://colab.research.google.com/github/danielesilva8/Aula_DataScience/blob/master/Introducao_a_Pandas_e_Series_de_Dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
notas = pd.Series([2,7,5,10,6])
notas

0     2
1     7
2     5
3    10
4     6
dtype: int64

In [3]:
notas.values

array([ 2,  7,  5, 10,  6])

In [4]:
notas = pd.Series([2,7,5,10,6], index=["Wilfred", "Abbie", "Harry", "Julia", "Carrie"])
notas

Wilfred     2
Abbie       7
Harry       5
Julia      10
Carrie      6
dtype: int64

In [6]:
notas['Julia']

10